Repository: sun-im/ibus-xkbc
Catalog: po/*.po
Languages: de, fr

source: XKBC Configuration
de: XKBC-Konfiguration
fr: Configuration XKBC

source: Virtual Keyboard layout Configuration
de: Konfiguration des virtuellen Tastaturlayouts
fr: Configuration de la disposition du clavier virtuelle

source: Target Layout
de: Ziellayout
fr: Disposition cible

source: Physical Layout
de: Physisches Layout
fr: Disposition physique

source: Hot Keys
fr: Raccourcis clavier

source: _Cancel
de: _Abbrechen
fr: A_nnuler

source: _Help
de: _Hilfe
fr: Aid_e

source: Hot key
fr: Raccourci clavier

source: Add...
de: Hinzufügen...
fr: Ajouter...

source: Delete
de: Entfernen
fr: Supprimer

source: _Add
de: _Hinzufügen
fr: _Ajouter

source: Please type here.
de: Drücken Sie hier die Tasten.
fr: Effectuez la saisie ici.

source: Hotkey add dialog
de: Dialogfeld zum Hinzufügen von Hotkeys
fr: Boîte de dialogue Ajout de raccourci clavier

source: Layout
fr: Disposition

source: Select
de: Auswählen
fr: Sélectionner

source: Switch layout hot keys
de: Hotkeys für Layoutumschaltung
fr: Raccourcis clavier de changement de disposition

source: Switch layout reverse order hot keys
de: Hotkeys für umgekehrte Reihenfolge der Layoutumschaltung
fr: Raccourcis clavier d'inversement de l'ordre du changement de disposition

source: Configure Layout Switch
de: Layoutumschaltung konfigurieren
fr: Configurer le changement de disposition

source: Virtual Keyboard
de: Virtuelle Tastatur
fr: Clavier virtuel

source: Geometry
de: Geometrie
fr: Géométrie

source: Active label only
de: Nur aktive Beschriftung
fr: Etiquette active uniquement

source: Gradation surface
de: Abstufungsfläche
fr: Surface de gradation

source: Keys only window
de: Fenster nur für Tasten
fr: Fenêtre de touches uniquement

source: Always below other windows
de: Immer unter anderen Fenstern
fr: Toujours sous les autres fenêtres

source: Layout list config...
de: Layoutliste konfigurieren...
fr: Configuration de la liste de dispositions...

source: Transparency
de: Transparenz
fr: Transparence

source: Exit
de: Beenden
fr: Quitter
